content/food/chicken-chettinad.org
#+HTML_LINK_HOME: ../..
#+HTML_LINK_UP: ./
#+title: Chicken Chettinad
#+author: Vishal Narayan
#+OPTIONS: title:nil

* Chicken Chettinad
Following the recipe from this [[https://www.youtube.com/watch?v=zVYa0abkdkE][youtube video]].

** Marinade
- 1/2 tsp turmeric powder
- 1 tbsp lemon juice
- few pinches of salt


This is for rougly 1lb chicken. Adjust proportions as necessary.


** Chettinad Masala

- 3 tbsp coriander seeds
- 6 dried red chillis
- 1 tbsp black pepper
- 1 tsp cumin seeds
- 1 tsp fennel seeds
- 1 green cardamom
- 1 black cardamom (just use extra green if you don't have these)
- 1 star anise
- 8 cloves
- 1 inch piece cinnamon
- 2 black stone flowers
- 1 blade of mace

  
- 6-8 cloves garlic
- 1 inch ginger
- 1 tsp tamarind paste
- pinch of fenugreek seeds


1. Heat up 1 tbsp of sesame oil in a pan.
2. Add 2 bay leaves, let sizzle.
3. Add spices.
4. Remove spices and let cool on a plate.
5. Heat up 1/4 fresh grated coconut in the same pan, adding oil if necessary.
6. Set aside coconut on same plate.
7. Add spices and coconut to blender.
8. Add second set of ingredients (garlic, ginger, tamarind, fenugreek).
9. Add water and blend into a paste.


** Cook
- 2 tbsp sesame oil
- 15 shallots, or 1 small red onion. Shallots preferred.
- 3 sprigs curry leaves


1. Heat oil and add shallots and curry leaves. Saute on medium flame until golden brown.
2. Add marinated chicken, high heat, saute and sear well.
3. Add chettinad masala, water, salt, bring to a boil.
4. Lower heat, cover with lid, and let boil for 10-15 minutes.
5. Garnish with coriander leaves. 
