docs/food/chicken-chettinad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chicken Chettinad</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="../.."> HOME </a>
</div><div id="content" class="content">

<div id="outline-container-org1fec036" class="outline-2">
<h2 id="org1fec036">Chicken Chettinad</h2>
<div class="outline-text-2" id="text-org1fec036">
<p>
Following the recipe from this <a href="https://www.youtube.com/watch?v=zVYa0abkdkE">youtube video</a>.
</p>
</div>

<div id="outline-container-org4314d7f" class="outline-3">
<h3 id="org4314d7f">Marinade</h3>
<div class="outline-text-3" id="text-org4314d7f">
<ul class="org-ul">
<li>1/2 tsp turmeric powder</li>
<li>1 tbsp lemon juice</li>
<li>few pinches of salt</li>
</ul>


<p>
This is for rougly 1lb chicken. Adjust proportions as necessary.
</p>
</div>
</div>


<div id="outline-container-org96f44f2" class="outline-3">
<h3 id="org96f44f2">Chettinad Masala</h3>
<div class="outline-text-3" id="text-org96f44f2">
<ul class="org-ul">
<li>3 tbsp coriander seeds</li>
<li>6 dried red chillis</li>
<li>1 tbsp black pepper</li>
<li>1 tsp cumin seeds</li>
<li>1 tsp fennel seeds</li>
<li>1 green cardamom</li>
<li>1 black cardamom (just use extra green if you don't have these)</li>
<li>1 star anise</li>
<li>8 cloves</li>
<li>1 inch piece cinnamon</li>
<li>2 black stone flowers</li>
<li>1 blade of mace</li>
</ul>


<ul class="org-ul">
<li>6-8 cloves garlic</li>
<li>1 inch ginger</li>
<li>1 tsp tamarind paste</li>
<li>pinch of fenugreek seeds</li>
</ul>


<ol class="org-ol">
<li>Heat up 1 tbsp of sesame oil in a pan.</li>
<li>Add 2 bay leaves, let sizzle.</li>
<li>Add spices.</li>
<li>Remove spices and let cool on a plate.</li>
<li>Heat up 1/4 fresh grated coconut in the same pan, adding oil if necessary.</li>
<li>Set aside coconut on same plate.</li>
<li>Add spices and coconut to blender.</li>
<li>Add second set of ingredients (garlic, ginger, tamarind, fenugreek).</li>
<li>Add water and blend into a paste.</li>
</ol>
</div>
</div>


<div id="outline-container-org6b0f4a6" class="outline-3">
<h3 id="org6b0f4a6">Cook</h3>
<div class="outline-text-3" id="text-org6b0f4a6">
<ul class="org-ul">
<li>2 tbsp sesame oil</li>
<li>15 shallots, or 1 small red onion. Shallots preferred.</li>
<li>3 sprigs curry leaves</li>
</ul>


<ol class="org-ol">
<li>Heat oil and add shallots and curry leaves. Saute on medium flame until golden brown.</li>
<li>Add marinated chicken, high heat, saute and sear well.</li>
<li>Add chettinad masala, water, salt, bring to a boil.</li>
<li>Lower heat, cover with lid, and let boil for 10-15 minutes.</li>
<li>Garnish with coriander leaves.</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
